# RemoveSizeTable Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySizeTableManager..::..RemoveSizeTable Method
FamilySizeTableManager Class See Also
---
Removes the FamilySizeTable of a given name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool RemoveSizeTable(
	string tableName
)
```

Visual Basic
---
```text
Public Function RemoveSizeTable ( _
	tableName As String _
) As Boolean
```

Visual C++
---
```text
public:
bool RemoveSizeTable(
	String^ tableName
)
```

# ### Parameters
tableName
    Type: System..::..String The FamilySizeTable name.
# ### Return Value
True if successful, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FamilySizeTableManager Class
Autodesk.Revit.DB Namespace